file=open("data1.csv",'x')
file.close()

import pandas as pd
df=pd.read_csv('data1.csv')
df

In [7]:
file=open('data.csv','x')
file.close()

In [10]:
import pandas as pd
df=pd.read_csv('data.csv')
df

   sn name  age           ph      add
0   1   dj   24    987766535      ktm
1   2   pk   23   9873625252  pyuthan
2   3   sk   33    986352525      npj
3   4   sp   22  98535353563      npj

In [11]:
df.head() #

   sn name  age           ph      add
0   1   dj   24    987766535      ktm
1   2   pk   23   9873625252  pyuthan
2   3   sk   33    986352525      npj
3   4   sp   22  98535353563      npj

In [12]:
df.tail()

   sn name  age           ph      add
0   1   dj   24    987766535      ktm
1   2   pk   23   9873625252  pyuthan
2   3   sk   33    986352525      npj
3   4   sp   22  98535353563      npj

In [16]:
df=pd.read_csv('data.csv',nrows=4,usecols=['sn','name','ph'])
df

   sn name           ph
0   1   dj    987766535
1   2   pk   9873625252
2   3   sk    986352525
3   4   sp  98535353563

In [17]:
# ilock : indexwise data fetch
# loc

In [22]:
df.iloc[1:3]

   sn name          ph
1   2   pk  9873625252
2   3   sk   986352525

In [25]:
df.iloc[1:3,0:2] # with column index 0:2

   sn name
1   2   pk
2   3   sk

In [26]:
df.columns # for hading or column of data to wher index i s the key

Index(['sn', 'name', 'ph'], dtype='object')

In [27]:
# index column: for making index first
df=pd.read_csv('data.csv',index_col='sn')
df

   name  age           ph      add
sn
1    dj   24    987766535      ktm
2    pk   23   9873625252  pyuthan
3    sk   33    986352525      npj
4    sp   22  98535353563      npj

In [28]:
df.loc[1:3]

   name  age          ph      add
sn
1    dj   24   987766535      ktm
2    pk   23  9873625252  pyuthan
3    sk   33   986352525      npj

In [30]:
df=pd.read_csv('data.csv',index_col='name')
df

      sn  age           ph      add
name
dj     1   24    987766535      ktm
pk     2   23   9873625252  pyuthan
sk     3   33    986352525      npj
sp     4   22  98535353563      npj

In [31]:
df.loc['dj':'sk']

      sn  age          ph      add
name
dj     1   24   987766535      ktm
pk     2   23  9873625252  pyuthan
sk     3   33   986352525      npj

In [ ]:
# filter the data

In [32]:
df=pd.read_csv('data.csv')
df['name']

0    dj
1    pk
2    sk
3    sp
4    kk
Name: name, dtype: object

In [34]:
df[df['name']=='dj']

   sn name  age         ph  add
0   1   dj   24  987766535  ktm

In [35]:
df[(df['add']=='ktm') & (df['age']>20)]

   sn name  age         ph  add
0   1   dj   24  987766535  ktm
4   5   kk   44      95858  ktm

In [36]:
# for new data save in the filter .csv  with according to user need 

df1=df[df['age']>20]
df1.to_csv('filter.csv')
df1

   sn name  age           ph      add
0   1   dj   24    987766535      ktm
1   2   pk   23   9873625252  pyuthan
2   3   sk   33    986352525      npj
3   4   sp   22  98535353563      npj
4   5   kk   44        95858      ktm

In [38]:
# concat: add the data 
data={'name':['rj','shree'],
     'age':[45,33],
     'add':['ktm','pyuthan']}
df1=pd.DataFrame(data)

data1={'name':['ram','shyam'],
     'age':[45,33],
     'add':['ktm','npj']}
df2=pd.DataFrame(data1)
df=pd.concat([df1,df2])
df

    name  age      add
0     rj   45      ktm
1  shree   33  pyuthan
0    ram   45      ktm
1  shyam   33      npj

In [46]:
#  addd column


df=pd.read_csv('data.csv',index_col='sn')# index_col= 'your row and col' for user to select 
df['gender']=['m','m','m','m','m']
df

   sn name  age           ph      add gender
0   1   dj   24    987766535      ktm      m
1   2   pk   23   9873625252  pyuthan      m
2   3   sk   33    986352525      npj      m
3   4   sp   22  98535353563      npj      m
4   5   kk   44        95858      ktm      m

In [47]:
df.to_csv('data.csv')

In [48]:
# read and writhe operation in list with

In [54]:
a=[['name','age','add'],
   ['ram',32,'ktm'],
   ['dj',22,'npj'],
   ['hari',44,'pyuthan']]
import csv
file= open('list_data.csv','w')
x=csv.writer(file)# object  with key word/or function (eriter and writerows) (i.e we create the object)
x.writerows(a)
file.close()

In [55]:
df=pd.read_csv('list_data.csv')
df

   name  age      add
0   ram   32      ktm
1    dj   22      npj
2  hari   44  pyuthan

In [57]:
# import pandas alwase need  
import csv
file = open('list_data.csv')
reader = csv.DictReader(file)
for row in reader:
    print(row)
df.to_csv('csvfile.csv')

{'name': 'ram', 'age': '32', 'add': 'ktm'}
{'name': 'dj', 'age': '22', 'add': 'npj'}
{'name': 'hari', 'age': '44', 'add': 'pyuthan'}

# diffrtnt file formate
 - df.to_csv('csvfile.csv')# 
 - df-to_json('csvfile.json')# data in the form of dictionary
 - df.to_xml('csvfile.xml')# html rep

In [64]:
df.to_csv('csvfile.csv')# 
df.to_json('csvfile.json')# data in the form of dictionary
df.to_xml('csvfile.xml')# html rep

In [61]:
pwd

'C:\\Users\\adams\\PycharmProjects\\pythonProject'

json_df=pd.read_json('csvfile.json')
json_df

# not suitable for all type of data or multiple type of data suitable for simelar type of data or

In [ ]:
# xampp for work in database to